{"pageProps":{"post":{"mdxSource":"var Component=(()=>{var h=Object.create;var s=Object.defineProperty;var c=Object.getOwnPropertyDescriptor;var m=Object.getOwnPropertyNames;var d=Object.getPrototypeOf,g=Object.prototype.hasOwnProperty;var o=a=>s(a,\"__esModule\",{value:!0});var p=(a,i)=>()=>(i||a((i={exports:{}}).exports,i),i.exports),u=(a,i)=>{o(a);for(var n in i)s(a,n,{get:i[n],enumerable:!0})},b=(a,i,n)=>{if(i&&typeof i==\"object\"||typeof i==\"function\")for(let t of m(i))!g.call(a,t)&&t!==\"default\"&&s(a,t,{get:()=>i[t],enumerable:!(n=c(i,t))||n.enumerable});return a},f=a=>b(o(s(a!=null?h(d(a)):{},\"default\",a&&a.__esModule&&\"default\"in a?{get:()=>a.default,enumerable:!0}:{value:a,enumerable:!0})),a);var l=p((T,r)=>{r.exports=_jsx_runtime});var x={};u(x,{default:()=>w,frontmatter:()=>y});var e=f(l()),y={title:\"algorithm classfication\",date:new Date(167789874e4),lastmod:\"2023-03-04\",tags:[\"voyagerX\",\"interview\",\"question\"],draft:!0,summary:\"\",layout:\"PostSimple\"};function k(a={}){let{wrapper:i}=a.components||{};return i?(0,e.jsx)(i,Object.assign({},a,{children:(0,e.jsx)(n,{})})):n();function n(){let t=Object.assign({p:\"p\",ol:\"ol\",li:\"li\",h3:\"h3\",a:\"a\",span:\"span\"},a.components);return(0,e.jsxs)(e.Fragment,{children:[(0,e.jsx)(t.p,{children:\"Here are some common classifications for coding test problems based on the topic or algorithm being tested:\"}),(0,e.jsxs)(t.ol,{children:[(0,e.jsx)(t.li,{children:(0,e.jsx)(t.p,{children:\"Data structures: Problems in this category typically test a candidate's knowledge of common data structures such as arrays, linked lists, stacks, queues, trees, and graphs.\"})}),(0,e.jsx)(t.li,{children:(0,e.jsx)(t.p,{children:\"Algorithms: This category covers a wide range of problems that test a candidate's knowledge of common algorithms such as sorting, searching, dynamic programming, greedy algorithms, and backtracking.\"})}),(0,e.jsx)(t.li,{children:(0,e.jsx)(t.p,{children:\"Math and logic: Problems in this category test a candidate's mathematical and logical reasoning skills, such as solving equations, finding prime numbers, or implementing mathematical formulas.\"})}),(0,e.jsx)(t.li,{children:(0,e.jsx)(t.p,{children:\"String manipulation: These problems test a candidate's ability to manipulate strings and perform operations such as string matching, pattern recognition, and regular expression parsing.\"})}),(0,e.jsx)(t.li,{children:(0,e.jsx)(t.p,{children:\"Computational geometry: This category covers problems that involve geometric algorithms, such as finding the convex hull of a set of points, calculating the distance between two points in a plane, or determining whether two line segments intersect.\"})}),(0,e.jsx)(t.li,{children:(0,e.jsx)(t.p,{children:\"Graph theory: These problems test a candidate's knowledge of graph algorithms such as finding shortest paths, minimum spanning trees, and topological sorting.\"})})]}),(0,e.jsxs)(t.h3,{id:\"algorithm\\uC5D0-\\uB530\\uB978-\\uBD84\\uB958\",children:[(0,e.jsx)(t.a,{\"aria-hidden\":\"true\",href:\"#algorithm\\uC5D0-\\uB530\\uB978-\\uBD84\\uB958\",tabIndex:\"-1\",children:(0,e.jsx)(t.span,{className:\"icon icon-link\"})}),\"algorithm\\uC5D0 \\uB530\\uB978 \\uBD84\\uB958\"]}),(0,e.jsxs)(t.ol,{children:[(0,e.jsx)(t.li,{children:(0,e.jsx)(t.p,{children:\"Sorting Algorithms: These algorithms are used to sort a set of data items in a particular order, such as alphabetical or numerical order. Examples include bubble sort, insertion sort, selection sort, merge sort, and quicksort.\"})}),(0,e.jsx)(t.li,{children:(0,e.jsx)(t.p,{children:\"Searching Algorithms: These algorithms are used to search for a particular item within a dataset. Examples include linear search, binary search, and interpolation search.\"})}),(0,e.jsx)(t.li,{children:(0,e.jsx)(t.p,{children:\"Dynamic Programming Algorithms: These algorithms are used to solve optimization problems by breaking them down into smaller subproblems and storing the solutions to these subproblems to avoid recomputation. Examples include the Knapsack problem, the Longest Common Subsequence problem, and the Fibonacci sequence.\"})}),(0,e.jsx)(t.li,{children:(0,e.jsx)(t.p,{children:\"Greedy Algorithms: These algorithms make locally optimal choices at each step in the hope of finding a global optimum. Examples include the Kruskal's algorithm for minimum spanning trees, the Dijkstra's algorithm for shortest paths, and the Huffman coding algorithm for data compression.\"})}),(0,e.jsx)(t.li,{children:(0,e.jsx)(t.p,{children:\"Backtracking Algorithms: These algorithms are used to find all possible solutions to a problem by incrementally building candidates to the solutions, and abandoning a candidate as soon as it is clear that the candidate cannot possibly be completed to a valid solution. Examples include the N-Queens problem and the Subset Sum problem.\"})}),(0,e.jsx)(t.li,{children:(0,e.jsx)(t.p,{children:\"Divide and Conquer Algorithms: These algorithms are used to solve problems by breaking them down into smaller subproblems, solving these subproblems recursively, and then combining the solutions to the subproblems to obtain the solution to the original problem. Examples include the Merge Sort algorithm, the Quick Sort algorithm, and the Karatsuba algorithm for multiplication.\"})})]}),(0,e.jsx)(t.p,{children:\"Linear algebra: Linear algebra is a branch of mathematics that deals with linear equations and their representations through matrices and vectors. It is essential for understanding the underlying concepts of machine learning algorithms, such as regression, classification, and clustering.\"}),(0,e.jsx)(t.p,{children:\"Calculus: Calculus is a branch of mathematics that deals with the study of continuous change. It is essential for understanding optimization algorithms, which are commonly used in machine learning models to optimize the model parameters.\"}),(0,e.jsx)(t.p,{children:\"Probability and statistics: Probability and statistics are essential for understanding uncertainty and randomness in data. They are the foundation of many machine learning algorithms, including Bayesian networks, decision trees, and random forests.\"}),(0,e.jsx)(t.p,{children:\"Optimization: Optimization is the process of finding the best solution among a set of possible solutions. It is essential for building machine learning models that can learn from data and make predictions based on that data.\"}),(0,e.jsx)(t.p,{children:\"Numerical methods: Numerical methods are essential for solving complex mathematical problems that cannot be solved analytically. They are used in many machine learning algorithms, such as gradient descent and linear programming.\"}),(0,e.jsx)(t.p,{children:\"Graph theory: Graph theory is the study of graphs, which are mathematical structures that represent relationships between objects. It is essential for understanding network analysis, which is commonly used in social network analysis and recommendation systems.\"})]})}}var w=k;return x;})();\n;return Component;","toc":[{"value":"algorithm에 따른 분류","url":"#algorithm에-따른-분류","depth":3}],"frontMatter":{"readingTime":{"text":"4 min read","minutes":3.26,"time":195600,"words":652},"slug":"algorithm_classification","fileName":"algorithm_classification.mdx","title":"algorithm classfication","date":"2023-03-04T02:59:00.000Z","lastmod":"2023-03-04","tags":["voyagerX","interview","question"],"draft":true,"summary":"","layout":"PostSimple"}},"authorDetails":[{"readingTime":{"text":"1 min read","minutes":0.155,"time":9300,"words":31},"slug":["default"],"fileName":"default.md","name":"demian11k","avatar":"/static/images/avatar.png","email":"demian11k@gmail.com","github":"https://github.com/demian9k","date":null}],"prev":{"title":"gorm-delete","date":"2023-11-23T22:11:33.000Z","lastmod":"2023-11-26","tags":["go","orm"],"draft":false,"summary":"","layout":"PostSimple","canonicalUrl":"https://demian9k.github.io/blog/gorm-delete/","slug":"gorm-delete"},"next":null},"__N_SSG":true}